garyPenhook/PyAvrOCD/svd/avr128da48s.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x00800600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>Command</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STCONV</name>
              <description>Start Conversion</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPCONV</name>
              <description>Stop Conversion</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ADC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free running mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESSEL</name>
              <description>Resolution selection</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>12BIT</name>
                  <description>12-bit mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BIT</name>
                  <description>10-bit mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEFTADJ</name>
              <description>Left adjust result</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CONVMODE</name>
              <description>Conversion mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLEENDED</name>
                  <description>Single-Ended mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIFF</name>
                  <description>Differential mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTBY</name>
              <description>Run standby mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPNUM</name>
              <description>Accumulation Samples</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No accumulation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC2</name>
                  <description>2 results accumulated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC4</name>
                  <description>4 results accumulated</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC8</name>
                  <description>8 results accumulated</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC16</name>
                  <description>16 results accumulated</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC32</name>
                  <description>32 results accumulated</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC64</name>
                  <description>64 results accumulated</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC128</name>
                  <description>128 results accumulated</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESC</name>
              <description>Clock Pre-scaler</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>CLK_PER divided by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_PER divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_PER divided by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>CLK_PER divided by 12</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_PER divided by 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV20</name>
                  <description>CLK_PER divided by 20</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV24</name>
                  <description>CLK_PER divided by 24</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV28</name>
                  <description>CLK_PER divided by 28</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_PER divided by 32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV48</name>
                  <description>CLK_PER divided by 48</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>CLK_PER divided by 64</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV96</name>
                  <description>CLK_PER divided by 96</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>CLK_PER divided by 128</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>CLK_PER divided by 256</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLD</name>
          <description>Control D</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPDLY</name>
              <description>Sampling Delay Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLY0</name>
                  <description>Delay 0 CLK_ADC cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY1</name>
                  <description>Delay 1 CLK_ADC cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY2</name>
                  <description>Delay 2 CLK_ADC cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY3</name>
                  <description>Delay 3 CLK_ADC cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY4</name>
                  <description>Delay 4 CLK_ADC cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY5</name>
                  <description>Delay 5 CLK_ADC cycles</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY6</name>
                  <description>Delay 6 CLK_ADC cycles</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY7</name>
                  <description>Delay 7 CLK_ADC cycles</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY8</name>
                  <description>Delay 8 CLK_ADC cycles</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY9</name>
                  <description>Delay 9 CLK_ADC cycles</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY10</name>
                  <description>Delay 10 CLK_ADC cycles</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY11</name>
                  <description>Delay 11 CLK_ADC cycles</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY12</name>
                  <description>Delay 12 CLK_ADC cycles</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY13</name>
                  <description>Delay 13 CLK_ADC cycles</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY14</name>
                  <description>Delay 14 CLK_ADC cycles</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY15</name>
                  <description>Delay 15 CLK_ADC cycles</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INITDLY</name>
              <description>Initial Delay Selection</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLY0</name>
                  <description>Delay 0 CLK_ADC cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY16</name>
                  <description>Delay 16 CLK_ADC cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY32</name>
                  <description>Delay 32 CLK_ADC cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY64</name>
                  <description>Delay 64 CLK_ADC cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY128</name>
                  <description>Delay 128 CLK_ADC cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY256</name>
                  <description>Delay 256 CLK_ADC cycles</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLE</name>
          <description>Control E</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINCM</name>
              <description>Window Comparator Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Window Comparison</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Below Window</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Above Window</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Inside Window</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTSIDE</name>
                  <description>Outside Window</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug run</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STARTEI</name>
              <description>Start Event Input Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMP</name>
              <description>Window Comparator Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMP</name>
              <description>Window Comparator Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUXNEG</name>
          <description>Negative mux input</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXNEG</name>
              <description>Analog Channel Selection Bits</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN0</name>
                  <description>ADC input pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN1</name>
                  <description>ADC input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN2</name>
                  <description>ADC input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN3</name>
                  <description>ADC input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN8</name>
                  <description>ADC input pin 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN9</name>
                  <description>ADC input pin 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN10</name>
                  <description>ADC input pin 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN11</name>
                  <description>ADC input pin 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>DAC0</description>
                  <value>72</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
