garyPenhook/PyAvrOCD/svd/avr128da48s.svd
        <register>
          <name>LUT5CTRLB</name>
          <description>LUT 5 Control B</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSEL0</name>
              <description>LUT Input 0 Source Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>IO pin LUTn-IN0 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0</name>
                  <description>AC0 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZCD0</name>
                  <description>ZCD0 OUT input source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>USART0 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 MOSI input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO0 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1</name>
                  <description>TCA1 WO0 input source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0</name>
                  <description>TCB0 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0</name>
                  <description>TCD0 WOA input source</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSEL1</name>
              <description>LUT Input 1 Source Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>IO pin LUTn-IN1 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1</name>
                  <description>AC1 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZCD1</name>
                  <description>ZCD1 OUT input source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>USART1 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 MOSI input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO1 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1</name>
                  <description>TCA1 WO1 input source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1</name>
                  <description>TCB1 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0</name>
                  <description>TCD0 WOB input source</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT5CTRLC</name>
          <description>LUT 5 Control C</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSEL2</name>
              <description>LUT Input 2 Source Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>IO pin LUTn-IN2 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2</name>
                  <description>AC2 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>USART2 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 SCK input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO2 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1</name>
                  <description>TCA1 WO2 input source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2</name>
                  <description>TCB2 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0</name>
                  <description>TCD0 WOC input source</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL0</name>
          <description>Sequential Control 0</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL1</name>
          <description>Sequential Control 1</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL2</name>
          <description>Sequential Control 2</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH0</name>
          <description>Truth 0</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH1</name>
          <description>Truth 1</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH2</name>
          <description>Truth 2</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH3</name>
          <description>Truth 3</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH4</name>
          <description>Truth 4</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH5</name>
          <description>Truth 5</description>
          <addressOffset>0x1F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
