garyPenhook/PyAvrOCD/svd/avr128da48s.svd
        <register>
          <name>CHANNEL3</name>
          <description>Multiplexer Channel 3</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL3</name>
              <description>Channel 3 generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI_SYNCH</name>
                  <description>UPDI SYNCH character</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV512</name>
                  <description>Periodic Interrupt Timer output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV256</name>
                  <description>Periodic Interrupt Timer output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV128</name>
                  <description>Periodic Interrupt Timer output 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV64</name>
                  <description>Periodic Interrupt Timer output 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT4</name>
                  <description>Configurable Custom Logic LUT4</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT5</name>
                  <description>Configurable Custom Logic LUT5</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RESRDY</name>
                  <description>ADC 0 Result Ready</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_RESRDY</name>
                  <description>PTC Result Ready</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZCD0</name>
                  <description>Zero Cross Detect 0 out</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZCD1</name>
                  <description>Zero Cross Detect 1 out</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN0</name>
                  <description>Port C Pin 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN1</name>
                  <description>Port C Pin 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN2</name>
                  <description>Port C Pin 2</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN3</name>
                  <description>Port C Pin 3</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN4</name>
                  <description>Port C Pin 4</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN5</name>
                  <description>Port C Pin 5</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN6</name>
                  <description>Port C Pin 6</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN7</name>
                  <description>Port C Pin 7</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN0</name>
                  <description>Port D Pin 0</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN1</name>
                  <description>Port D Pin 1</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN2</name>
                  <description>Port D Pin 2</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN3</name>
                  <description>Port D Pin 3</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN4</name>
                  <description>Port D Pin 4</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN5</name>
                  <description>Port D Pin 5</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN6</name>
                  <description>Port D Pin 6</description>
                  <value>78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN7</name>
                  <description>Port D Pin 7</description>
                  <value>79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_XCK</name>
                  <description>USART 2 XCK</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3_XCK</name>
                  <description>USART 3 XCK</description>
                  <value>99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART4_XCK</name>
                  <description>USART 4 XCK</description>
                  <value>100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 SCK</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_SCK</name>
                  <description>SPI 1 SCK</description>
                  <value>105</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte timer underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte timer underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 compare 0 / low byte timer compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 compare 1 / low byte timer compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 compare 2 / low byte timer compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_OVF_LUNF</name>
                  <description>Timer/Counter A1 overflow / low byte timer underflow</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_HUNF</name>
                  <description>Timer/Counter A1 high byte timer underflow</description>
                  <value>137</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP0_LCMP0</name>
                  <description>Timer/Counter A1 compare 0 / low byte timer compare 0</description>
                  <value>140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP1_LCMP1</name>
                  <description>Timer/Counter A1 compare 1 / low byte timer compare 1</description>
                  <value>141</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP2_LCMP2</name>
                  <description>Timer/Counter A1 compare 2 / low byte timer compare 2</description>
                  <value>142</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 overflow</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_CAPT</name>
                  <description>Timer/Counter B2 capture</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_OVF</name>
                  <description>Timer/Counter B2 overflow</description>
                  <value>165</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_CAPT</name>
                  <description>Timer/Counter B3 capture</description>
                  <value>166</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_OVF</name>
                  <description>Timer/Counter B3 overflow</description>
                  <value>167</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 event 0</description>
                  <value>176</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 event 1</description>
                  <value>177</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 event 2</description>
                  <value>178</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 event 3</description>
                  <value>179</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
